.emacs.d/general/readme.org
#+TITLE: General config
#+AUTHOR: umi
#+OPTIONS: toc:t

* GENERAL CONFIGURATION
Functions
#+begin_src emacs-lisp
  (defun open-window-left()
    (interactive)
    (evil-window-vsplit))

  (defun open-window-right()
    (interactive)
    (evil-window-vsplit)
    (evil-window-right 1))

  (defun open-window-up()
    (interactive)
    (evil-window-split))

  (defun open-window-down()
    (interactive)
    (evil-window-split)
    (evil-window-down 1))

  (defun load-config-file()
    (interactive)
    (load-file "~/.emacs.d/init.el"))
#+end_src


Setup
#+begin_src emacs-lisp
  (with-eval-after-load 'general
    (general-evil-setup)
    (setq global-map (make-sparse-keymap))
    (general-define-key
     :states 'normal
     "SPC s" nil))
#+end_src

Defining leader key
#+begin_src emacs-lisp
  (with-eval-after-load 'general
    (general-create-definer leader
      :states '(normal visual)
      :keymaps '(global override)
      :prefix "SPC"))
#+end_src

Mappings
#+begin_src emacs-lisp
  (with-eval-after-load 'general
    (leader
      "rr" 'load-config-file)

    (general-define-key
     :states '(normal visual)
     :keymaps '(global override)
     "J" 'scroll-up-command
     "K" 'scroll-down-command
     )

    (general-define-key
     :states '(normal)
     :keymaps '(global override)
     "C-h" 'evil-window-left
     "C-j" 'evil-window-down 
     "C-k" 'evil-window-up
     "C-l" 'evil-window-right)

    (general-create-definer window
      :keymaps '(global override)
      :wrapping leader
      :infix "w")

    (window
      "h" 'open-window-left
      "j" 'open-window-down
      "k" 'open-window-up
      "l" 'open-window-right)

    (general-define-key
     :states '(normal)
     :keymaps '(global)
     "RET" 'org-open-at-point)

    (general-create-definer buffer
      :keymaps '(global override)
      :wrapping leader
      :infix "b")

    (buffer
      "n" 'next-buffer
      "p" 'previous-buffer
      "k" 'kill-buffer)

    (general-define-key
     :states '(normal visual)
     :keymaps '(help-mode-map)
     (kbd "<backtab>") 'outline-cycle-buffer))
#+end_src
